
[error]
1=Card was not found!
2=Fail to reset!
3=The card version was mismatch!
4=Warning!
6=Execute Failed!
7=Invalid status!
16=Command Overtime!
17=Command Lost!
18=Interface call exception!
19=Interface used by another program!
20=Z Outrange or Z calitable file lost!
21=Paramter mismatch!
23=Allocate memory error!
100=Offline status!
101=Stop!
1001=PORT1
1002=PORT2
1003=PORT3
1004=PORT4
1005=PORT5
1006=PORT6
1007=PORT7
1008=LASER IN NOT READY
1009=LASER IN OK


[4]
1 = Fiber laser core overheat!
2 = Fiber laser core high reflection alarm!
3 = Abnormal fiber laser core MO!
4 = Laser interlocked!
5 = Safety door is open!
6 = Error occurred when closing optical shutter!
7 = Error occurred when opening optical shutter!
8 = Safety door is open and marking paused!
9 = Safety door is open and marking stop!
10= Laser system alarm!
11= Laser voltage over range!
12= Laser overvoltage alarm!
13= Laser undervoltage alarm!
14= SPI Laser overheat alarm!
15= SPI Laser prime amplifier overcurrent alarm!
16= SPI Laser power amplifier overcurrent alarm!
17= SPI Laser collimator alarm!
18= SPI Laser reserved alarm!
19= SPI Laser power alarm!
20= Unknown laser alarm!
21= Laser current overcurrent alarm!
22= Laser power overvoltage alarm!
23= Laser power overheat alarm!
24= Laser power shut down.
30= Marking stop,negative limit!
31= Marking stop,Positive limit!
32= Motor pulse out of range!
33= DA out of range!
34= Platform x-axis positive limit!
35= Platform x-axis negative limit!
36= Platform y-axis positive limit!
37= Platform y-axis negative limit!
38= Galvanometer power is abnormal, please turn off the power and check
54= Please use 512 calibrate-table!
55= Please use 128 calibrate-table!
100=Safe Door had been opened!
110=Touch Negative Limit!
111=Touch Positive Limit!
112=Touch Home position!
500=Scan is preheating,please wait a moment!

[door]
1=Safe Door Opened.
2=Safe Door Opened, Marking Paused.
3=Safe Door Opened, Marking Stopped.
4=Safe Door Closed, Marking could be continued.
5=Safe Door Closed, EMCC card is ready to mark.
6=Encounter Negative limit during motor moving.
7=Encounter Postive  limit during motor moving.


[usb]
1=EMCC card connected.
2=EMCC card disconnected.


[4101]
3=DA 1 version information
4=DA 1 release date
5=DA 1 run time
7=DA 1 error frames
9=DA 1 countdown 4th  error
11=DA 1 countdown 3rd error
13=DA 1 penultimate error
15=DA 1 countdown 1st error

[4102]
4=DA 1 lost frames
6=DA 1 countdown 4th lost time
8=DA 1 countdown 3rd lost time
10=DA 1 penultimate lost time
12=DA 1 countdown 1st lost time
14=DA 1 galvanometer alarm information
15=DA 1 laser off enable

[4103]
3=DA 2 version information 
4=DA 2 release date
5=DA 2 run time
7=DA 2 error frames
9=DA 2 countdown 4th  error
11=DA 2 countdown 3rd error
13=DA 2 penultimate error
15=DA 2 countdown 1st error

[4104]
4=DA 2 lost frames
6=DA 2 countdown 4th lost time
8=DA 2 countdown 3rd lost time
10=DA 2 penultimate lost time
12=DA 2 countdown 1st lost time
14=DA 2 galvanometer alarm information
15=DA 2 laser off enable

[4105]
3=LASER version information
4=LASER release date
5=LASER run time
7=LASER error frames
9=LASER countdown 4th error
11=LASER card countdown 3rd error
13=LASER card penultimate error
15=LASER card countdown 1st error

[4106]
4=LASER card lost frames
6=LASER card countdown 4th lost time
8=LASER card countdown 3rd lost time
10=LASER card penultimate lost time
12=LASER card countdown 1st lost time
14=LASER card galvanometer alarm information
15=LASER laser off enable

[4107]
3=LASER card ns
4=LASER card ps
5=LASER card fs
6=LASER card keep power


[4102Warning]
0=D0:DA 1 Data communication error
1=D1:DA 1 Scanner system alarm
2=D2:DA 1 Scanner temperature alarm
3=D3:DA 1 Scanner low speed alarm
4=D4:Unused
5=D5:Unused
6=D6:Unused
7=D7:Unused
8=D8:Unused
9=D9:Unused
10=D10:Unused
11=D11:Unused
12=D12:Unused
13=D13:Unused
14=D14:Unused
15=D15:EMCC card data communication error

[4104Warning]
0=D0:DA 2 Data communication error
1=D1:DA 2 Scanner system alarm
2=D2:DA 2 Scanner temperature alarm
3=D3:DA 2 Scanner low speed alarm
4=D4:Unused
5=D5:Unused
6=D6:Unused
7=D7:Unused
8=D8:Unused
9=D9:Unused
10=D10:Unused
11=D11:Unused
12=D12:Unused
13=D13:Unused
14=D14:Unused
15=D15:Unused

[4106Warning]
0=D0:LASER data communication error
1=D1:LASER temperature alarm
2=D2:Power alarm
3=D3:System alarm
4=D4:High anti alarm
5=D5:Laser not ready
6=D6:Seed laser ignition failure
7=D7:Seed laser temperature alarm
8=D8:MO Overcurrent warning
9=D9:PA Overcurrent warning
10=D10:Collimator alarm
11=D11:Reserved 5
12=D12:Reserved 4
13=D13:Reserved 3
14=D14:Reserved 2
15=D15:Reserved 1

[Refresh]
Interval=500
